RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_pixelmux_regs.h
/*
 * DSI1_EN (RW)
 *
 * DSI0 pixel bus enable
 */
#define PIXELMUX_PIXMUX_DSI1_EN_MASK (0x80000UL)
#define PIXELMUX_PIXMUX_DSI1_EN_SHIFT (19U)
#define PIXELMUX_PIXMUX_DSI1_EN_SET(x) (((uint32_t)(x) << PIXELMUX_PIXMUX_DSI1_EN_SHIFT) & PIXELMUX_PIXMUX_DSI1_EN_MASK)
#define PIXELMUX_PIXMUX_DSI1_EN_GET(x) (((uint32_t)(x) & PIXELMUX_PIXMUX_DSI1_EN_MASK) >> PIXELMUX_PIXMUX_DSI1_EN_SHIFT)

/*
 * DSI1_SEL (RW)
 *
 * DSI0 pixel bus selection
 * 1: LCDC1
 * 0: LCDC0
 */
#define PIXELMUX_PIXMUX_DSI1_SEL_MASK (0x40000UL)
#define PIXELMUX_PIXMUX_DSI1_SEL_SHIFT (18U)
#define PIXELMUX_PIXMUX_DSI1_SEL_SET(x) (((uint32_t)(x) << PIXELMUX_PIXMUX_DSI1_SEL_SHIFT) & PIXELMUX_PIXMUX_DSI1_SEL_MASK)
#define PIXELMUX_PIXMUX_DSI1_SEL_GET(x) (((uint32_t)(x) & PIXELMUX_PIXMUX_DSI1_SEL_MASK) >> PIXELMUX_PIXMUX_DSI1_SEL_SHIFT)

/*
 * DSI0_EN (RW)
 *
 * DSI1 pixel bus enable
 */
#define PIXELMUX_PIXMUX_DSI0_EN_MASK (0x20000UL)
#define PIXELMUX_PIXMUX_DSI0_EN_SHIFT (17U)
#define PIXELMUX_PIXMUX_DSI0_EN_SET(x) (((uint32_t)(x) << PIXELMUX_PIXMUX_DSI0_EN_SHIFT) & PIXELMUX_PIXMUX_DSI0_EN_MASK)
#define PIXELMUX_PIXMUX_DSI0_EN_GET(x) (((uint32_t)(x) & PIXELMUX_PIXMUX_DSI0_EN_MASK) >> PIXELMUX_PIXMUX_DSI0_EN_SHIFT)

/*
 * DSI0_SEL (RW)
 *
 * DSI1 pixel bus selection
 * 1: LCDC1
 * 0: LCDC0
 */
#define PIXELMUX_PIXMUX_DSI0_SEL_MASK (0x10000UL)
#define PIXELMUX_PIXMUX_DSI0_SEL_SHIFT (16U)
#define PIXELMUX_PIXMUX_DSI0_SEL_SET(x) (((uint32_t)(x) << PIXELMUX_PIXMUX_DSI0_SEL_SHIFT) & PIXELMUX_PIXMUX_DSI0_SEL_MASK)
#define PIXELMUX_PIXMUX_DSI0_SEL_GET(x) (((uint32_t)(x) & PIXELMUX_PIXMUX_DSI0_SEL_MASK) >> PIXELMUX_PIXMUX_DSI0_SEL_SHIFT)

/*
 * CAM1_EN (RW)
 *
 * CAM1 pixel bus enable
 */
#define PIXELMUX_PIXMUX_CAM1_EN_MASK (0x80U)
#define PIXELMUX_PIXMUX_CAM1_EN_SHIFT (7U)
#define PIXELMUX_PIXMUX_CAM1_EN_SET(x) (((uint32_t)(x) << PIXELMUX_PIXMUX_CAM1_EN_SHIFT) & PIXELMUX_PIXMUX_CAM1_EN_MASK)
#define PIXELMUX_PIXMUX_CAM1_EN_GET(x) (((uint32_t)(x) & PIXELMUX_PIXMUX_CAM1_EN_MASK) >> PIXELMUX_PIXMUX_CAM1_EN_SHIFT)

/*
 * CAM1_SEL (RW)
 *
 * CAM1 pixel bus selection
 * 111: Reserved
 * 110: LCB1
 * 101: LCB0
 * 100: LCDC1
 * 011: LCDC0
 * 010: CSI1
 * 001: CSI0
 * 000: DVP
 */
#define PIXELMUX_PIXMUX_CAM1_SEL_MASK (0x70U)
#define PIXELMUX_PIXMUX_CAM1_SEL_SHIFT (4U)
#define PIXELMUX_PIXMUX_CAM1_SEL_SET(x) (((uint32_t)(x) << PIXELMUX_PIXMUX_CAM1_SEL_SHIFT) & PIXELMUX_PIXMUX_CAM1_SEL_MASK)
#define PIXELMUX_PIXMUX_CAM1_SEL_GET(x) (((uint32_t)(x) & PIXELMUX_PIXMUX_CAM1_SEL_MASK) >> PIXELMUX_PIXMUX_CAM1_SEL_SHIFT)

/*
 * CAM0_EN (RW)
 *
 * CAM0 pixel bus enable
 */
#define PIXELMUX_PIXMUX_CAM0_EN_MASK (0x8U)
#define PIXELMUX_PIXMUX_CAM0_EN_SHIFT (3U)
#define PIXELMUX_PIXMUX_CAM0_EN_SET(x) (((uint32_t)(x) << PIXELMUX_PIXMUX_CAM0_EN_SHIFT) & PIXELMUX_PIXMUX_CAM0_EN_MASK)
#define PIXELMUX_PIXMUX_CAM0_EN_GET(x) (((uint32_t)(x) & PIXELMUX_PIXMUX_CAM0_EN_MASK) >> PIXELMUX_PIXMUX_CAM0_EN_SHIFT)

/*
 * CAM0_SEL (RW)
 *
 * CAM0 pixel bus selection
 * 111: Reserved
 * 110: LCB1
 * 101: LCB0
 * 100: LCDC1
 * 011: LCDC0
 * 010: CSI1
 * 001: CSI0
 * 000: DVP
 */
#define PIXELMUX_PIXMUX_CAM0_SEL_MASK (0x7U)
#define PIXELMUX_PIXMUX_CAM0_SEL_SHIFT (0U)
#define PIXELMUX_PIXMUX_CAM0_SEL_SET(x) (((uint32_t)(x) << PIXELMUX_PIXMUX_CAM0_SEL_SHIFT) & PIXELMUX_PIXMUX_CAM0_SEL_MASK)
#define PIXELMUX_PIXMUX_CAM0_SEL_GET(x) (((uint32_t)(x) & PIXELMUX_PIXMUX_CAM0_SEL_MASK) >> PIXELMUX_PIXMUX_CAM0_SEL_SHIFT)

/* Bitfield definition for register array: DSI_SETTING */
/*
 * DSI_DATA_ENABLE (RW)
 *
 * DSI pixel data type enable:
 * Bit0: RGB565_CFG1
 * Bit1: RGB565_CFG2
 * Bit2: RGB565_CFG3
 * Bit3: RGB666_CFG1
 * Bit4: RGB666_CFG2
 * Bit5: RGB888
 * Bit6: RGB_10BIT
 * Bit7: RGB_12BIT, no support
 * Bit8: YUV422_12BIT, no support
 * Bit9: YUV422_10BIT, no support
 * Bit10: YUV422_8BIT, no support
 * Bit11:YUV420_8BIT,no support
 * others: Reserved
 */
#define PIXELMUX_DSI_SETTING_DSI_DATA_ENABLE_MASK (0xFFFF0000UL)
#define PIXELMUX_DSI_SETTING_DSI_DATA_ENABLE_SHIFT (16U)
#define PIXELMUX_DSI_SETTING_DSI_DATA_ENABLE_SET(x) (((uint32_t)(x) << PIXELMUX_DSI_SETTING_DSI_DATA_ENABLE_SHIFT) & PIXELMUX_DSI_SETTING_DSI_DATA_ENABLE_MASK)
#define PIXELMUX_DSI_SETTING_DSI_DATA_ENABLE_GET(x) (((uint32_t)(x) & PIXELMUX_DSI_SETTING_DSI_DATA_ENABLE_MASK) >> PIXELMUX_DSI_SETTING_DSI_DATA_ENABLE_SHIFT)

/*
 * DSI_DATA_TYPE (RW)
 *
 * DSI input pixel data type:
 * ‘h0: RGB565_CFG1
 * ‘h1: RGB565_CFG2
 * ‘h2: RGB565_CFG3
 * ‘h3: RGB666_CFG1
 * ‘h4: RGB666_CFG2
 * ‘h5: RGB888
 * ‘h6: RGB_10BIT
 * ‘h7: RGB_12BIT, no support
 * ‘h8:YUV422_12BIT,no support
 * ‘h9: YUV422_10BIT, no support
 * ‘ha: YUV422_8BIT, no support
 * ‘hb: YUV420_8BIT,no support
 * ‘hc~’hf: Reserved
 */
#define PIXELMUX_DSI_SETTING_DSI_DATA_TYPE_MASK (0xFU)
#define PIXELMUX_DSI_SETTING_DSI_DATA_TYPE_SHIFT (0U)
#define PIXELMUX_DSI_SETTING_DSI_DATA_TYPE_SET(x) (((uint32_t)(x) << PIXELMUX_DSI_SETTING_DSI_DATA_TYPE_SHIFT) & PIXELMUX_DSI_SETTING_DSI_DATA_TYPE_MASK)
#define PIXELMUX_DSI_SETTING_DSI_DATA_TYPE_GET(x) (((uint32_t)(x) & PIXELMUX_DSI_SETTING_DSI_DATA_TYPE_MASK) >> PIXELMUX_DSI_SETTING_DSI_DATA_TYPE_SHIFT)

/* Bitfield definition for register: MISC */
/*
 * LVB_DI1_CTL (RW)
 *
 * LVB DI1 optional general purpose control which is usually unused by display
 */
#define PIXELMUX_MISC_LVB_DI1_CTL_MASK (0x2U)
#define PIXELMUX_MISC_LVB_DI1_CTL_SHIFT (1U)
#define PIXELMUX_MISC_LVB_DI1_CTL_SET(x) (((uint32_t)(x) << PIXELMUX_MISC_LVB_DI1_CTL_SHIFT) & PIXELMUX_MISC_LVB_DI1_CTL_MASK)
#define PIXELMUX_MISC_LVB_DI1_CTL_GET(x) (((uint32_t)(x) & PIXELMUX_MISC_LVB_DI1_CTL_MASK) >> PIXELMUX_MISC_LVB_DI1_CTL_SHIFT)

/*
 * LVB_DI0_CTL (RW)
 *
 * LVB DI0 optional general purpose control which is usually unused by display
 */
#define PIXELMUX_MISC_LVB_DI0_CTL_MASK (0x1U)
#define PIXELMUX_MISC_LVB_DI0_CTL_SHIFT (0U)
#define PIXELMUX_MISC_LVB_DI0_CTL_SET(x) (((uint32_t)(x) << PIXELMUX_MISC_LVB_DI0_CTL_SHIFT) & PIXELMUX_MISC_LVB_DI0_CTL_MASK)
#define PIXELMUX_MISC_LVB_DI0_CTL_GET(x) (((uint32_t)(x) & PIXELMUX_MISC_LVB_DI0_CTL_MASK) >> PIXELMUX_MISC_LVB_DI0_CTL_SHIFT)

/* Bitfield definition for register: GPR_WR_D0 */
/*
 * CSI1_CFG_AP_IF_CHECK_EN (RW)
 *
 * csi1 apb interface parity check enable
 */
#define PIXELMUX_GPR_WR_D0_CSI1_CFG_AP_IF_CHECK_EN_MASK (0x7C00000UL)
#define PIXELMUX_GPR_WR_D0_CSI1_CFG_AP_IF_CHECK_EN_SHIFT (22U)
#define PIXELMUX_GPR_WR_D0_CSI1_CFG_AP_IF_CHECK_EN_SET(x) (((uint32_t)(x) << PIXELMUX_GPR_WR_D0_CSI1_CFG_AP_IF_CHECK_EN_SHIFT) & PIXELMUX_GPR_WR_D0_CSI1_CFG_AP_IF_CHECK_EN_MASK)
#define PIXELMUX_GPR_WR_D0_CSI1_CFG_AP_IF_CHECK_EN_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_WR_D0_CSI1_CFG_AP_IF_CHECK_EN_MASK) >> PIXELMUX_GPR_WR_D0_CSI1_CFG_AP_IF_CHECK_EN_SHIFT)

