RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_pixelmux_regs.h
/*
 * CSI0_SOFT_RESET_N (RW)
 *
 * csi controller 0 reset, active low
 */
#define PIXELMUX_GPR_WR_D0_CSI0_SOFT_RESET_N_MASK (0x4U)
#define PIXELMUX_GPR_WR_D0_CSI0_SOFT_RESET_N_SHIFT (2U)
#define PIXELMUX_GPR_WR_D0_CSI0_SOFT_RESET_N_SET(x) (((uint32_t)(x) << PIXELMUX_GPR_WR_D0_CSI0_SOFT_RESET_N_SHIFT) & PIXELMUX_GPR_WR_D0_CSI0_SOFT_RESET_N_MASK)
#define PIXELMUX_GPR_WR_D0_CSI0_SOFT_RESET_N_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_WR_D0_CSI0_SOFT_RESET_N_MASK) >> PIXELMUX_GPR_WR_D0_CSI0_SOFT_RESET_N_SHIFT)

/*
 * DSI1_SOFT_RESET_N (RW)
 *
 * dsi controller 1 reset, active low
 */
#define PIXELMUX_GPR_WR_D0_DSI1_SOFT_RESET_N_MASK (0x2U)
#define PIXELMUX_GPR_WR_D0_DSI1_SOFT_RESET_N_SHIFT (1U)
#define PIXELMUX_GPR_WR_D0_DSI1_SOFT_RESET_N_SET(x) (((uint32_t)(x) << PIXELMUX_GPR_WR_D0_DSI1_SOFT_RESET_N_SHIFT) & PIXELMUX_GPR_WR_D0_DSI1_SOFT_RESET_N_MASK)
#define PIXELMUX_GPR_WR_D0_DSI1_SOFT_RESET_N_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_WR_D0_DSI1_SOFT_RESET_N_MASK) >> PIXELMUX_GPR_WR_D0_DSI1_SOFT_RESET_N_SHIFT)

/*
 * DSI0_SOFT_RESET_N (RW)
 *
 * dsi controller 0 reset, active low
 */
#define PIXELMUX_GPR_WR_D0_DSI0_SOFT_RESET_N_MASK (0x1U)
#define PIXELMUX_GPR_WR_D0_DSI0_SOFT_RESET_N_SHIFT (0U)
#define PIXELMUX_GPR_WR_D0_DSI0_SOFT_RESET_N_SET(x) (((uint32_t)(x) << PIXELMUX_GPR_WR_D0_DSI0_SOFT_RESET_N_SHIFT) & PIXELMUX_GPR_WR_D0_DSI0_SOFT_RESET_N_MASK)
#define PIXELMUX_GPR_WR_D0_DSI0_SOFT_RESET_N_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_WR_D0_DSI0_SOFT_RESET_N_MASK) >> PIXELMUX_GPR_WR_D0_DSI0_SOFT_RESET_N_SHIFT)

/* Bitfield definition for register: GPR_WR_D1 */
/*
 * JPEG_CTRL (RW)
 *
 * bit0: select cam0;
 * bit1: select cam1;
 * bit2: select jpeg;
 * bit3: select pdma
 */
#define PIXELMUX_GPR_WR_D1_JPEG_CTRL_MASK (0xF000000UL)
#define PIXELMUX_GPR_WR_D1_JPEG_CTRL_SHIFT (24U)
#define PIXELMUX_GPR_WR_D1_JPEG_CTRL_SET(x) (((uint32_t)(x) << PIXELMUX_GPR_WR_D1_JPEG_CTRL_SHIFT) & PIXELMUX_GPR_WR_D1_JPEG_CTRL_MASK)
#define PIXELMUX_GPR_WR_D1_JPEG_CTRL_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_WR_D1_JPEG_CTRL_MASK) >> PIXELMUX_GPR_WR_D1_JPEG_CTRL_SHIFT)

/*
 * PDMA_P1_CTRL (RW)
 *
 * bit0: select cam0;
 * bit1: select cam1;
 * bit2: select jpeg;
 * bit3: select pdma
 */
#define PIXELMUX_GPR_WR_D1_PDMA_P1_CTRL_MASK (0xF00000UL)
#define PIXELMUX_GPR_WR_D1_PDMA_P1_CTRL_SHIFT (20U)
#define PIXELMUX_GPR_WR_D1_PDMA_P1_CTRL_SET(x) (((uint32_t)(x) << PIXELMUX_GPR_WR_D1_PDMA_P1_CTRL_SHIFT) & PIXELMUX_GPR_WR_D1_PDMA_P1_CTRL_MASK)
#define PIXELMUX_GPR_WR_D1_PDMA_P1_CTRL_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_WR_D1_PDMA_P1_CTRL_MASK) >> PIXELMUX_GPR_WR_D1_PDMA_P1_CTRL_SHIFT)

/*
 * PDMA_P0_CTRL (RW)
 *
 * bit0: select cam0;
 * bit1: select cam1;
 * bit2: select jpeg;
 * bit3: select pdma
 */
#define PIXELMUX_GPR_WR_D1_PDMA_P0_CTRL_MASK (0xF0000UL)
#define PIXELMUX_GPR_WR_D1_PDMA_P0_CTRL_SHIFT (16U)
#define PIXELMUX_GPR_WR_D1_PDMA_P0_CTRL_SET(x) (((uint32_t)(x) << PIXELMUX_GPR_WR_D1_PDMA_P0_CTRL_SHIFT) & PIXELMUX_GPR_WR_D1_PDMA_P0_CTRL_MASK)
#define PIXELMUX_GPR_WR_D1_PDMA_P0_CTRL_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_WR_D1_PDMA_P0_CTRL_MASK) >> PIXELMUX_GPR_WR_D1_PDMA_P0_CTRL_SHIFT)

/*
 * LCDC1_P1_CTRL (RW)
 *
 * bit0: select cam0;
 * bit1: select cam1;
 * bit2: select jpeg;
 * bit3: select pdma
 */
#define PIXELMUX_GPR_WR_D1_LCDC1_P1_CTRL_MASK (0xF000U)
#define PIXELMUX_GPR_WR_D1_LCDC1_P1_CTRL_SHIFT (12U)
#define PIXELMUX_GPR_WR_D1_LCDC1_P1_CTRL_SET(x) (((uint32_t)(x) << PIXELMUX_GPR_WR_D1_LCDC1_P1_CTRL_SHIFT) & PIXELMUX_GPR_WR_D1_LCDC1_P1_CTRL_MASK)
#define PIXELMUX_GPR_WR_D1_LCDC1_P1_CTRL_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_WR_D1_LCDC1_P1_CTRL_MASK) >> PIXELMUX_GPR_WR_D1_LCDC1_P1_CTRL_SHIFT)

/*
 * LCDC1_P0_CTRL (RW)
 *
 * bit0: select cam0;
 * bit1: select cam1;
 * bit2: select jpeg;
 * bit3: select pdma
 */
#define PIXELMUX_GPR_WR_D1_LCDC1_P0_CTRL_MASK (0xF00U)
#define PIXELMUX_GPR_WR_D1_LCDC1_P0_CTRL_SHIFT (8U)
#define PIXELMUX_GPR_WR_D1_LCDC1_P0_CTRL_SET(x) (((uint32_t)(x) << PIXELMUX_GPR_WR_D1_LCDC1_P0_CTRL_SHIFT) & PIXELMUX_GPR_WR_D1_LCDC1_P0_CTRL_MASK)
#define PIXELMUX_GPR_WR_D1_LCDC1_P0_CTRL_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_WR_D1_LCDC1_P0_CTRL_MASK) >> PIXELMUX_GPR_WR_D1_LCDC1_P0_CTRL_SHIFT)

/*
 * LCDC0_P1_CTRL (RW)
 *
 * bit0: select cam0;
 * bit1: select cam1;
 * bit2: select jpeg;
 * bit3: select pdma
 */
#define PIXELMUX_GPR_WR_D1_LCDC0_P1_CTRL_MASK (0xF0U)
#define PIXELMUX_GPR_WR_D1_LCDC0_P1_CTRL_SHIFT (4U)
#define PIXELMUX_GPR_WR_D1_LCDC0_P1_CTRL_SET(x) (((uint32_t)(x) << PIXELMUX_GPR_WR_D1_LCDC0_P1_CTRL_SHIFT) & PIXELMUX_GPR_WR_D1_LCDC0_P1_CTRL_MASK)
#define PIXELMUX_GPR_WR_D1_LCDC0_P1_CTRL_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_WR_D1_LCDC0_P1_CTRL_MASK) >> PIXELMUX_GPR_WR_D1_LCDC0_P1_CTRL_SHIFT)

/*
 * LCDC0_P0_CTRL (RW)
 *
 * bit0: select cam0;
 * bit1: select cam1;
 * bit2: select jpeg;
 * bit3: select pdma
 */
#define PIXELMUX_GPR_WR_D1_LCDC0_P0_CTRL_MASK (0xFU)
#define PIXELMUX_GPR_WR_D1_LCDC0_P0_CTRL_SHIFT (0U)
#define PIXELMUX_GPR_WR_D1_LCDC0_P0_CTRL_SET(x) (((uint32_t)(x) << PIXELMUX_GPR_WR_D1_LCDC0_P0_CTRL_SHIFT) & PIXELMUX_GPR_WR_D1_LCDC0_P0_CTRL_MASK)
#define PIXELMUX_GPR_WR_D1_LCDC0_P0_CTRL_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_WR_D1_LCDC0_P0_CTRL_MASK) >> PIXELMUX_GPR_WR_D1_LCDC0_P0_CTRL_SHIFT)

/* Bitfield definition for register: GPR_WR_D2 */
/*
 * TX_PHY0_PORT_PLL_RDY_SEL (RW)
 *
 * tx phy0 port_pll_rdy_sel
 */
#define PIXELMUX_GPR_WR_D2_TX_PHY0_PORT_PLL_RDY_SEL_MASK (0x20000000UL)
#define PIXELMUX_GPR_WR_D2_TX_PHY0_PORT_PLL_RDY_SEL_SHIFT (29U)
#define PIXELMUX_GPR_WR_D2_TX_PHY0_PORT_PLL_RDY_SEL_SET(x) (((uint32_t)(x) << PIXELMUX_GPR_WR_D2_TX_PHY0_PORT_PLL_RDY_SEL_SHIFT) & PIXELMUX_GPR_WR_D2_TX_PHY0_PORT_PLL_RDY_SEL_MASK)
#define PIXELMUX_GPR_WR_D2_TX_PHY0_PORT_PLL_RDY_SEL_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_WR_D2_TX_PHY0_PORT_PLL_RDY_SEL_MASK) >> PIXELMUX_GPR_WR_D2_TX_PHY0_PORT_PLL_RDY_SEL_SHIFT)

/*
 * TX_PHY0_RATE_LVDS (RW)
 *
 * tx phy0 rate_lvds
 */
#define PIXELMUX_GPR_WR_D2_TX_PHY0_RATE_LVDS_MASK (0x18000000UL)
#define PIXELMUX_GPR_WR_D2_TX_PHY0_RATE_LVDS_SHIFT (27U)
#define PIXELMUX_GPR_WR_D2_TX_PHY0_RATE_LVDS_SET(x) (((uint32_t)(x) << PIXELMUX_GPR_WR_D2_TX_PHY0_RATE_LVDS_SHIFT) & PIXELMUX_GPR_WR_D2_TX_PHY0_RATE_LVDS_MASK)
#define PIXELMUX_GPR_WR_D2_TX_PHY0_RATE_LVDS_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_WR_D2_TX_PHY0_RATE_LVDS_MASK) >> PIXELMUX_GPR_WR_D2_TX_PHY0_RATE_LVDS_SHIFT)

