RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_pixelmux_regs.h
/*
 * RX_PHY1_PHY_MODE (RW)
 *
 * rx phy1 phy_mode
 */
#define PIXELMUX_GPR_WR_D9_RX_PHY1_PHY_MODE_MASK (0x3U)
#define PIXELMUX_GPR_WR_D9_RX_PHY1_PHY_MODE_SHIFT (0U)
#define PIXELMUX_GPR_WR_D9_RX_PHY1_PHY_MODE_SET(x) (((uint32_t)(x) << PIXELMUX_GPR_WR_D9_RX_PHY1_PHY_MODE_SHIFT) & PIXELMUX_GPR_WR_D9_RX_PHY1_PHY_MODE_MASK)
#define PIXELMUX_GPR_WR_D9_RX_PHY1_PHY_MODE_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_WR_D9_RX_PHY1_PHY_MODE_MASK) >> PIXELMUX_GPR_WR_D9_RX_PHY1_PHY_MODE_SHIFT)

/* Bitfield definition for register: GPR_RO_D0 */
/*
 * TX_PHY1_CTL_O (RO)
 *
 * {2'b0,
 * tx_phy1_tx3_ctl_o,tx_phy1_tx2_ctl_o,
 * tx_phy1_tx1_ctl_o,tx_phy1_tx0_ctl_o,
 * tx_phy1_txck_ctl_o,tx_phy1_pll_dtest_o}
 */
#define PIXELMUX_GPR_RO_D0_TX_PHY1_CTL_O_MASK (0xFF00U)
#define PIXELMUX_GPR_RO_D0_TX_PHY1_CTL_O_SHIFT (8U)
#define PIXELMUX_GPR_RO_D0_TX_PHY1_CTL_O_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_RO_D0_TX_PHY1_CTL_O_MASK) >> PIXELMUX_GPR_RO_D0_TX_PHY1_CTL_O_SHIFT)

/*
 * TX_PHY0_CTL_O (RO)
 *
 * {2'b0,
 * tx_phy0_tx3_ctl_o,tx_phy0_tx2_ctl_o,
 * tx_phy0_tx1_ctl_o,tx_phy0_tx0_ctl_o,
 * tx_phy0_txck_ctl_o,tx_phy0_pll_dtest_o}
 */
#define PIXELMUX_GPR_RO_D0_TX_PHY0_CTL_O_MASK (0xFFU)
#define PIXELMUX_GPR_RO_D0_TX_PHY0_CTL_O_SHIFT (0U)
#define PIXELMUX_GPR_RO_D0_TX_PHY0_CTL_O_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_RO_D0_TX_PHY0_CTL_O_MASK) >> PIXELMUX_GPR_RO_D0_TX_PHY0_CTL_O_SHIFT)

/* Bitfield definition for register: GPR_RO_D1 */
/*
 * IRQ_CSI0_AP (RO)
 *
 * interrupt of csi0 ap
 */
#define PIXELMUX_GPR_RO_D1_IRQ_CSI0_AP_MASK (0x20000UL)
#define PIXELMUX_GPR_RO_D1_IRQ_CSI0_AP_SHIFT (17U)
#define PIXELMUX_GPR_RO_D1_IRQ_CSI0_AP_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_RO_D1_IRQ_CSI0_AP_MASK) >> PIXELMUX_GPR_RO_D1_IRQ_CSI0_AP_SHIFT)

/*
 * CSI0_CFG_CSI_AP_DIAG_FAULTS (RO)
 *
 * csi0 ap diag faults
 */
#define PIXELMUX_GPR_RO_D1_CSI0_CFG_CSI_AP_DIAG_FAULTS_MASK (0x1FFE0UL)
#define PIXELMUX_GPR_RO_D1_CSI0_CFG_CSI_AP_DIAG_FAULTS_SHIFT (5U)
#define PIXELMUX_GPR_RO_D1_CSI0_CFG_CSI_AP_DIAG_FAULTS_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_RO_D1_CSI0_CFG_CSI_AP_DIAG_FAULTS_MASK) >> PIXELMUX_GPR_RO_D1_CSI0_CFG_CSI_AP_DIAG_FAULTS_SHIFT)

/*
 * CSI0_STA_AP_IF_INT_STA (RO)
 *
 * csi0 apb parity check interrupt satus
 */
#define PIXELMUX_GPR_RO_D1_CSI0_STA_AP_IF_INT_STA_MASK (0x1FU)
#define PIXELMUX_GPR_RO_D1_CSI0_STA_AP_IF_INT_STA_SHIFT (0U)
#define PIXELMUX_GPR_RO_D1_CSI0_STA_AP_IF_INT_STA_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_RO_D1_CSI0_STA_AP_IF_INT_STA_MASK) >> PIXELMUX_GPR_RO_D1_CSI0_STA_AP_IF_INT_STA_SHIFT)

/* Bitfield definition for register: GPR_RO_D2 */
/*
 * IRQ_CSI1_AP (RO)
 *
 * interrupt of csi1 ap
 */
#define PIXELMUX_GPR_RO_D2_IRQ_CSI1_AP_MASK (0x20000UL)
#define PIXELMUX_GPR_RO_D2_IRQ_CSI1_AP_SHIFT (17U)
#define PIXELMUX_GPR_RO_D2_IRQ_CSI1_AP_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_RO_D2_IRQ_CSI1_AP_MASK) >> PIXELMUX_GPR_RO_D2_IRQ_CSI1_AP_SHIFT)

/*
 * CSI1_CFG_CSI_AP_DIAG_FAULTS (RO)
 *
 * csi1 ap diag faults
 */
#define PIXELMUX_GPR_RO_D2_CSI1_CFG_CSI_AP_DIAG_FAULTS_MASK (0x1FFE0UL)
#define PIXELMUX_GPR_RO_D2_CSI1_CFG_CSI_AP_DIAG_FAULTS_SHIFT (5U)
#define PIXELMUX_GPR_RO_D2_CSI1_CFG_CSI_AP_DIAG_FAULTS_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_RO_D2_CSI1_CFG_CSI_AP_DIAG_FAULTS_MASK) >> PIXELMUX_GPR_RO_D2_CSI1_CFG_CSI_AP_DIAG_FAULTS_SHIFT)

/*
 * CSI1_STA_AP_IF_INT_STA (RO)
 *
 * csi1 apb parity check interrupt satus
 */
#define PIXELMUX_GPR_RO_D2_CSI1_STA_AP_IF_INT_STA_MASK (0x1FU)
#define PIXELMUX_GPR_RO_D2_CSI1_STA_AP_IF_INT_STA_SHIFT (0U)
#define PIXELMUX_GPR_RO_D2_CSI1_STA_AP_IF_INT_STA_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_RO_D2_CSI1_STA_AP_IF_INT_STA_MASK) >> PIXELMUX_GPR_RO_D2_CSI1_STA_AP_IF_INT_STA_SHIFT)

/* Bitfield definition for register: GPR_RO_D3 */
/*
 * RX_PHY0_RXCK_CTLO (RO)
 *
 * rx phy0 rxck_ctlo
 */
#define PIXELMUX_GPR_RO_D3_RX_PHY0_RXCK_CTLO_MASK (0xFF00U)
#define PIXELMUX_GPR_RO_D3_RX_PHY0_RXCK_CTLO_SHIFT (8U)
#define PIXELMUX_GPR_RO_D3_RX_PHY0_RXCK_CTLO_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_RO_D3_RX_PHY0_RXCK_CTLO_MASK) >> PIXELMUX_GPR_RO_D3_RX_PHY0_RXCK_CTLO_SHIFT)

/*
 * RX_PHY0_RX1_CTLO (RO)
 *
 * rx phy0 rx1_ctlo
 */
#define PIXELMUX_GPR_RO_D3_RX_PHY0_RX1_CTLO_MASK (0xF0U)
#define PIXELMUX_GPR_RO_D3_RX_PHY0_RX1_CTLO_SHIFT (4U)
#define PIXELMUX_GPR_RO_D3_RX_PHY0_RX1_CTLO_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_RO_D3_RX_PHY0_RX1_CTLO_MASK) >> PIXELMUX_GPR_RO_D3_RX_PHY0_RX1_CTLO_SHIFT)

/*
 * RX_PHY0_RX0_CTLO (RO)
 *
 * rx phy0 rx0_ctlo
 */
#define PIXELMUX_GPR_RO_D3_RX_PHY0_RX0_CTLO_MASK (0xFU)
#define PIXELMUX_GPR_RO_D3_RX_PHY0_RX0_CTLO_SHIFT (0U)
#define PIXELMUX_GPR_RO_D3_RX_PHY0_RX0_CTLO_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_RO_D3_RX_PHY0_RX0_CTLO_MASK) >> PIXELMUX_GPR_RO_D3_RX_PHY0_RX0_CTLO_SHIFT)

/* Bitfield definition for register: GPR_RO_D4 */
/*
 * RX_PHY1_RXCK_CTLO (RO)
 *
 * rx phy1 rxck_ctlo
 */
#define PIXELMUX_GPR_RO_D4_RX_PHY1_RXCK_CTLO_MASK (0xFF00U)
#define PIXELMUX_GPR_RO_D4_RX_PHY1_RXCK_CTLO_SHIFT (8U)
#define PIXELMUX_GPR_RO_D4_RX_PHY1_RXCK_CTLO_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_RO_D4_RX_PHY1_RXCK_CTLO_MASK) >> PIXELMUX_GPR_RO_D4_RX_PHY1_RXCK_CTLO_SHIFT)

/*
 * RX_PHY1_RX1_CTLO (RO)
 *
 * rx phy1 rx1_ctlo
 */
#define PIXELMUX_GPR_RO_D4_RX_PHY1_RX1_CTLO_MASK (0xF0U)
#define PIXELMUX_GPR_RO_D4_RX_PHY1_RX1_CTLO_SHIFT (4U)
#define PIXELMUX_GPR_RO_D4_RX_PHY1_RX1_CTLO_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_RO_D4_RX_PHY1_RX1_CTLO_MASK) >> PIXELMUX_GPR_RO_D4_RX_PHY1_RX1_CTLO_SHIFT)

/*
 * RX_PHY1_RX0_CTLO (RO)
 *
 * rx phy1 rx0_ctlo
 */
#define PIXELMUX_GPR_RO_D4_RX_PHY1_RX0_CTLO_MASK (0xFU)
#define PIXELMUX_GPR_RO_D4_RX_PHY1_RX0_CTLO_SHIFT (0U)
#define PIXELMUX_GPR_RO_D4_RX_PHY1_RX0_CTLO_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_RO_D4_RX_PHY1_RX0_CTLO_MASK) >> PIXELMUX_GPR_RO_D4_RX_PHY1_RX0_CTLO_SHIFT)

/* Bitfield definition for register: GPR_RO_D5 */
/*
 * DSI0_PRBS_STATE (RO)
 *
 * dsi0_prbs_state for debug only
 */
#define PIXELMUX_GPR_RO_D5_DSI0_PRBS_STATE_MASK (0xF000U)
#define PIXELMUX_GPR_RO_D5_DSI0_PRBS_STATE_SHIFT (12U)
#define PIXELMUX_GPR_RO_D5_DSI0_PRBS_STATE_GET(x) (((uint32_t)(x) & PIXELMUX_GPR_RO_D5_DSI0_PRBS_STATE_MASK) >> PIXELMUX_GPR_RO_D5_DSI0_PRBS_STATE_SHIFT)

